package level05.lesson12;
/*
Вывести на экран сегодняшнюю дату
*/
/*Вывести на экран текущую дату в аналогичном виде "21 02 2014".*/
public class Task4 {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("19 08 2019");
    }
}
