package level03.lesson12;
/*
Меркантильные намерения
*/

/*Вывести на экран десять раз надпись "Я хочу большую зарплату, и для этого изучаю Java"*/
public class Task2 {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
    }
}
