package level01.lesson08;
/*
Не хочешь  - решай нехотя
*/

/*Напиши программу, которая выводит на экран надпись: "Хочешь - решай задачи, не хочешь - решай нехотя" 16 раз.*/
public class Task4 {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    }
}
