package level01.lesson08;
/*
Любимое стихотворение
*/

/*В методе main напиши код, чтобы в результате выполнения программы было выведено твое любимое стихотворение.
        В стихотворении должно быть не меньше, чем 4 строчки. Не убирай вывод строчки "Мое любимое стихотворение:".*/
public class Task2 {
    public static void main(String[] args) {
        System.out.println("Мое любимое стихотворение:");
        //напишите тут ваш код
        System.out.println("У лукоморья дуб зеленый;");
        System.out.println("Златая цепь на дубе том;");
        System.out.println("И днем и ночью кот ученый");
        System.out.println("Всё ходит по цепи кругом;");
    }
}
