package level00.lesson04;

/*
Комплимент учителю
*/

/*Написать программу, выводящую на экран надпись "Элли самая красивая" 5 раз. Каждый раз - с новой строки.*/
public class Task1 {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
    }
}