package level00.lesson04;

/*
Мой юный друг
*/

/*Сейчас 3126 год. Мой друг родился 8 лет назад.
Написать программу, выводящую на экран год рождения моего друга.*/

public class Task2 {
    public static void main(String[] args) {
        //напишите тут ваш код
        int year = 3126 - 8;
        System.out.println(year);
    }
}
