package level04.lesson10;
/*
От 10 до 1
*/

/*Вывести на экран числа от 10 до 1 используя цикл while. Каждое значение с новой строки.*/
public class Task2 {
    public static void main(String[] args) {
        //напишите тут ваш код
        int a =10;
        while (a > 0)
        {
            System.out.println(a);
            a--;
        }

    }
}
