package level04.lesson10;
/*
Гадание на долларовый счет
*/
/*Вывести на экран квадрат из 10х10 букв S используя цикл while.
Буквы в каждой строке не разделять.*/
public class Task4 {
    public static void main(String[] args) {
        //напишите тут ваш код
        int i =0;
        while (i < 10)
        {
            System.out.println("SSSSSSSSSS");
            i++;
        }
    }
}
