package level01.lesson03;
/*
Выводим квадрат числа
*/

/*Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной (number * number).*/

public class Task4 {
    public static int number = 25;

    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println(number*number);
    }
}
