package level03.lesson04;
/*
Я так давно родился
*/

/*Вывести на экран дату своего рождения в виде:
MAY 1 2012*/
public class Task1 {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("MAY 1 2012");
    }
}
