package level03.lesson04;
/*
Сумма 5 чисел
*/

/*Вывести на экран сумму чисел от 1 до 5 построчно (должно быть 5 строк):
1
1+2=3
1+2+3=6
...

Пример вывода:
1
3
6
...*/
public class Task5 {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println(1);
        System.out.println(1+2);
        System.out.println(1+2+3);
        System.out.println(1+2+3+4);
        System.out.println(1+2+3+4+5);
    }
}
