package level10.lesson11;
/*
Большая зарплата
*/
/*Вывести на экран надпись "Я не хочу изучать Java, я хочу большую зарплату" 40 раз по образцу.*/
public class Task4 {
    public static void main(String[] args) {
        String s = "Я не хочу изучать Java, я хочу большую зарплату";
        for(int i=0;i<40;i++)
        {
            System.out.println(s.substring(i,s.length()));

        }

        //напишите тут ваш код
    }
}
